# ModifyingIssuedRevisionCloudOnUpgrade Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RevisionCloudFailures..::..ModifyingIssuedRevisionCloudOnUpgrade Property
BuiltInFailures..::..RevisionCloudFailures Class See Also
---
During upgrade, an issued revision cloud was moved. Please double check the revision cloud to ensure it is located in the correct place.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ModifyingIssuedRevisionCloudOnUpgrade { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ModifyingIssuedRevisionCloudOnUpgrade As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ModifyingIssuedRevisionCloudOnUpgrade {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RevisionCloudFailures Class
Autodesk.Revit.DB Namespace